######################################
# for문 , in을 사용해서 반복하기
######################################
for looper in [1,2,3,4,5]:
    print(looper)

######################################
# for문 , range() 사용하기
######################################
for looper in range(0, 10):
    print(looper)

######################################
# for문 , list를 range()로 만들기
######################################
test_list = list(range(5))
for looper in test_list:
    print(looper)

######################################
# for문 , 문자열 나눠서 출력하기
######################################
for i in 'abcdefg':
    print(i)

######################################
# for문 , 배열의 문자열 출력하기
######################################
for i in ['문자1','문자2','문자3']:
    print(i)

######################################
# for문 , range 범위 정해서 출력하기
######################################
for i in range(0, 100, 5):
    print(i)
